// <Булева логіка>

// && - І

// Я піду гуляти з друзями якщо мене відпустить мама и буде гарна погода

// якщо мене відпустить мама
// буде гарна погода

// 1)якщо мене відпустить мама = false ,буде гарна погода = true - false
// 2)якщо мене відпустить мама = true , буде гарна погода = false - false
// 3)якщо мене відпустить мама = true , буде гарна погода = true - true
// 4)якщо мене відпустить мама = false , буде гарна погода = false - false

// закономірність? -  якщо є хоча б один false завжди false
// true = всі наші умови === true

// || - АБО

// Я піду гуляти з друзями якщо в мене є парасолька або буде гарна погода

// якщо в мене є парасолька - true,  буде гарна погода - false - true
// якщо в мене є парасолька - false,  буде гарна погода - false - false
// якщо в мене є парасолька - false,  буде гарна погода - true - true
// якщо в мене є парасолька - true,  буде гарна погода - true - true

// Закономірність? - якщо є хоча б одне true то буде завжди повертатись true

//  !(not) - Значення навпаки
// !true - не true = false
// !false - не false = true

//  Чому логічні оператори називають лінивими

//Логічні оператори завжди повертають boolean значення (true або false)

function umbrella() {
  console.log("Парасолька");
}
function goodWeather() {
  console.log("Гарна погода");
}

// Логічні оператори називають лінивими тому-що якщо вони бачать хоча б одне непідходяще правило вони одразу на ньому зупиняються
console.log(false && umbrella());
console.log(umbrella() || false);
