// 1)Напиши скрипт, який об'єднує всі елементи массива в один рядок.  Елементів може бути довільна кількість. Нехай елементи массива  в рядку будут розділені комою.
//  - Спочатку через for
//  - Потім через join()
// const friends = ['Mango', 'Poly', 'Kiwi', 'Ajax'];

// let string = '';

// 2)Працюємо з колекцією карток в trello.  Метод splice() (можна використати інші методи)

// const cards = [
//     'Карточка-1',
//     'Карточка-2',
//     'Карточка-3',
//     'Карточка-4',
//     'Карточка-5',
//   ];
//  Видалити
// /*
//    * Видалення (по індексу), метод indexOf()
//    */
//   const cardToRemove = 'Карточка-3';

//  Додати
// /*
//    * Додавання (по індексу)
//    */

// const cardToInsert = 'Карточка-6';

//  Оновити
// /*
//    * Оновлення (по індексу)
//    */
//   const cardToUpdate = 'Карточка-4';
