// 1)Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні - "Не всі поля заповнені".

// 1)Створити HTML з яким ми будемо працювати
// 2)Отримати доступ до елементів(отримати елементи)
// 3)Утворити слухач події на подію клік
// 4) if else (&&)

//document.querySelector = дозволяє отримати доступ до елементів html у JS
const field1 = document.querySelector("#input1");
const field2 = document.querySelector("#input2");
const button = document.querySelector("#button");

// addEventListener = додає прослуховувач події
button.addEventListener("click", onClick);

function onClick(e) {
  // if ... else
  if (field1.value && field2.value) {
    console.log("Ти все заповнив гуляй.ГРошиків нє вєрнєм");
  } else {
    console.log("Ти не все заповнив .віддай гроші");
  }
}

// 2)Створити розмітку  з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні - "Сума менша або дорівнює 10".

// 1)Створити розмітку
// 2)Отримати доступ до елементів(отримати елементи)
const inp1 = document.querySelector("#inp1");
const inp2 = document.querySelector("#inp2");
const btn = document.querySelector("#btn");
// 3)Додаємо слухач події на кнопку
btn.addEventListener("click", onCLick1);
// 4)Пишемо логіку яка має відбуватись при події
function onCLick1(e) {
  if (Number(inp1.value) + Number(inp2.value) > 10) {
    console.log("Сума більша за 10");
  } else {
    console.log("Сума менша або дорівнює 10");
  }
}

// 3)Створити розмітку  з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні - "Текст не містить слово JavaScript".

// 4)Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні - "Число не входить в діапазон від 10 до 20".

// 5)Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні - виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.
