// 1)Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

// let counter = 1;

// while (counter <= 10) {
//   console.log(counter);
//   counter += 1;
// }

// 2)Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.Якщо число непарне, пропустити його за допомогою continue.

// 1) Лічильник - точка відліку, на початку  зазвичай дорівнює 0
// 2) Умова виходу з циклу - Якщо умова перестає виконуватись то цикл зупиняється
// 3) Операція над лічильником - Відпрацьовує після спрацювання тіла циклу може бути будь-яка
// 4) Тіло циклу = {}
// Ітерація - це виконання тіла циклу один раз

// for (let i = 0; i <= 20; i++) {
//   // Перевірка на не парність
//   if (i % 2 === 1) {
//     //   Якщо ми знайшли не парне число ми його скіпаємо
//     // continue - пропускає цю ітерацію і одразу переходить до натсупної
//     continue;
//   }
//   console.log(i);
// }

// 3)Вивести на екран таблицю множення числа 7 за допомогою циклу for.

for (let index = 7; index <= 70; index += 7) {
  console.log(index);
}

// 4)Cтворити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

// 5)Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

// 6)Створити скрипт, який виводить на екран всі числа, які менші за n.Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

// n - будь-яке число яке ви можете вигадать
// const n = 10;
// let counter = 0;

// while (counter <= n) {
//   counter += 1;
//   console.log(counter);
//   if (counter > n) {
//     break;
//   }
// }

// for (let index = 1; index <= n; index++) {
//   console.log(index);
// }

// 7)За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

//  n - будь-яке число яке ви можете вигадать
// const n = 20;
// let counter = 1;

// while (counter <= n) {
//   if (counter % 3 === 0) {
//     counter += 1;
//     continue;
//   } else {
//     console.log(counter);
//   }
//   counter += 1;
// }
