// 1.Які типи даних відносяться до примітивних?

// 2.Що таке властивість та метод?

// 3.Які є методи парсу числа?

// 4.Які оператори ви пам’ятаєте?

// ---Дізнаємось які методи та властивості використовуються --------------------при роботі з рядками

// Методи

// --------------Навчитися працювати з рядками.------------

// Навчимося зшивати рядки.

// --Навчимося працювати з оператором % - ділення на ціло---

//  Створити скрипт який буде переводити будь яке число в формат часу використовуючи оператор %.
