// 1.Які типи даних ви знаєте?
// число(Number),рядок(String), булеан(Boolean),undefined = не знайшов,null = Розробники встановлюють власноруч,   bigInt(Велике число),symbol(Контекст).

// 2.Що таке властивість(довжина, товщина,висота) та метод(Піти погуляти, зроботи домашку)?

// 3.Які є методи парсу числа (parseInt() parseFloat())?

// 4.Які математичні оператори ви пам’ятаєте?

// + - / *

// оператори порівняння
// <= >= == === < >
// == - не порівнює типи данних; === - порівнює типи данних;

// =  - це оператор присвоєння значення

const a = 10;

// ---Дізнаємось які методи та властивості використовуються --------------------при роботі з рядками
// Рядок то є набір символів у яких є свій індекс (індекс починає рахуватись з першого елемент і на першому елементі він дорівнює 0 )
// Рядок це індексований набір символів, може бути 0 символів ,(будь який рядок має бути записаний у лапках '' "")

const string = "Артем"; // індекс букви т = 2
// Індекси завжди починаються з 0
// Індекс завжди на 1 менший за довжину тому що він починається з 0 string.length - 1
console.log(string.length); //починає рахувать з одиниці(1)

// Методи

// --------------Навчитися працювати з рядками.------------

// Навчимося зшивати рядки.

// Навчимося працювати з оператором % - ділення на ціле число

//  Створити скрипт який буде переводити будь яке число в формат часу використовуючи оператор %.
