// Розбір ДЗ(цикли) - 1h
// Що таке масив?

// 4)Cтворити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

// Масив - це бездонна коробка в яку ми можемо покласти будь-яку інформацію. Використовується для зберігання колекції данних Наприклад:(users, products)

// Щоб створити масив треба написати []
// щоб додати щось в масив достатньо записати бажане в квадратні дужки
const string = "Hello";
const array = [1, "Привіт", "", {}, false]; // супер рідкий випадок
// як  правило масив це колекція однотипних данних

// const numbers = [1, 2, 3, 4, 5];
// let counter = 0;
// while (counter < numbers.length) {
//   counter++;
//   console.log(counter);
// }

// length - властивість яка зберігає кількість елеметів
// console.log(array);

// 5)Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

// const nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// for (let index = 1; index <= nums.length; index++) {
//   if (index === 7) {
//     continue;
//   }
//   console.log(index);
// }

// for (let index = 1; index <= nums.length; index++) {
//   if (index === 7) {
//     continue;
//   }
//   console.log(index);
// }

const arr = [1, 2, 3, 4, 5];

// Довжина починає відлік з 1
console.log("довжина :", arr.length);
// Індекс починає свій розрахунок з 0
// 1 має індекс 0
// 2 має індекс 1
// 3 має індекс 2
// 4 має індекс 3
// 5 має індекс 4
console.log("Індекс останнього елементу :", arr.length - 1);
// щоб отримати доступ до елемента ми маємо звернутись до елемента через квадратні дужки з індексом
console.log(arr[2]);

// Перевизначення
// Для того щоб перевизначити якесь значення ви маєте звернутись до нього за індексом та через = його замінити

arr[2] = 0;
arr[5] = 6;
// так робити не треба
// arr[100000] = 7;

console.log(arr);

const numbers = [];

for (let index = 0; index < 100; index++) {
  // push() - він додає елементи в кінець масив
  //   numbers.push(index);
  //   index; - лічильник
  // numbers[index]
  // index + 1 = оскільки індекси рахуються з 0
  numbers[index] = index + 1;
}
console.log(numbers);
// Як працювати з масивами
//  -- як отримати елемент масиву
//  -- як замінити елемент масиву
//  -- як додати елемент в масив
// Перебиремо масив за допомгою вже знайомих нам циклів

// Як тільки ви бачити,що ви працюєте з масивом скоріш за все вам треба його перебрати за допомогою циклів або інших методів
// for (let index = 0; index < numbers.length; index++) {
//   const element = numbers[index];
//   if (index % 2 === 0) {
//     break;
//   }
//   console.log(index);
// }

// for..of не використовує індекси
// object - масив який ми перебираємо
// for (let number of numbers) {
//   //   console.log(number);
//   console.log((number += number));
// }

const clients = ["Artem", "Petro", "htos"];

const nameToFind = "Artem";

// Цикл буде повторюватись стільки разів скільки у вас елементів у масиві
for (const client of clients) {
  if (client === nameToFind) {
    console.log("Ми тебе знайшли");
    //   зупиняє цикл
    break;
  }
  console.log(client);
}
