// ------------Дізнаємось що таке функція.-----------

//  -----------Які є способи створення функцій. ----------

// 1)спосіб створення function declaration()
// Функціональнй вираз
// function = створення функції
// function name(doCoffee) = імʼя функції яку ми будемо розробляту
// () - набір аргументів які потрібні для адекватної роботи функції
// {} - тіло нашої функії яке буде виконуватись
function doCoffee(water, milk, coffee) {
  console.log("вода : " + water, "молока : " + milk, "кава : " + coffee);

  if (coffee && milk && water) {
    console.log("Роблю каву з молоком");
  } else if (water && coffee) {
    console.log("Роблю каву ");
  } else if (water) {
    console.log("Додайте каву та молоко бо є лише вода");
  } else {
    console.log("тут нічого немає");
  }
}

// Методи, це функції.
// наша функція doCoffee() приймає три параметри
// Дуже важливо передавати всі аргументи по тій черзі,що ви вказали у функції
doCoffee("вода", "молоко", "кава");

// -------- Вивчимо що таке функціональна область видимості.
// --------------- Розберемо порядок виконання коду.
//-------------- Вивчимо що таке параметри та аргументи.
// -------------------------Ціль уроку:
//-------- Навчитися створювати та використовувати  функції
