// 1)Написати скрипт відкриття та закриття модального вікна по кнопці.(розмітка  є у NewDz.html)

// 2)Використовуючи попередній код написати скрипт закриття модального вікна по кліку на бекдроп(розмітка  є у NewDz.html)

// 3)Напиши скрипт в якому є три радіобатони зі значенями кольрів. При обиранніна будь якого колір фону боді змінюється відповідно(розмітка форми є у NewDz.html)

// 4) Напиши скрипт який, при наборі тексту в інпут input#name-input (подія input), підставляє його поточне значення в span#name-output. якщо інпут порожній, в спані повинен відображатися рядок 'незнайомець'.(розмітка форми є у NewDz.html)

// 5)Напиши скрипт, який би при втраті фокуса на інпут, перевіряв його вміст на правильну кількість символів.(розмітка форми є у NewDz.html)
// Скільки символів має бути в інпут, вказується в його атрибуті data-length.
// Якщо введена відповідна кількість, то border інпут стає зеленим,   якщо неправильне - червоним.
// Для додавання стилів, використовуй CSS-класи valid і invalid.(стилі  є у NewDz.html)

// 6) Напиши скрипт, який реагує на зміну значення input#font-size-control (подія input) і змінює інлайн-стиль span#text оновлюючи властивість font-size. В результаті при перетягуванні повзунка змінюватиметься розмір тексту.
